src/tr069/samples/tr069_set_parameter_attributes_invalid_2param_req.xml

<soapenv:Envelope
  xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
  soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:cwmp="urn:dslforum-org:cwmp-1-0">
    <soapenv:Header>
      <cwmp:ID soap:mustUnderstand="1">1234</cwmp:ID>
    </soapenv:Header>
    <soapenv:Body>
      <cwmp:SetParameterAttributes>
         <ParameterList soap:arrayType="cwmp:SetParameterAttributeStruct[2]">
	     <ParameterList>
	         <cwmp:SetParameterAttributesStruct>
	             <Name>.a.b.</Name>
	             <NotificationChange>1</NotificationChange>
	             <Notification>2</Notification>
	             <AccessListChange>1</AccessListChange>
	             <cwmp:AccessList>
	               <string>Subscriber</string>
	             </cwmp:AccessList>
	         </cwmp:SetParameterAttributesStruct>
	         <cwmp:SetParameterAttributesStruct>
	             <Name>.a.b.c</Name>
	             <NotificationChange>1</NotificationChange>
	             <Notification>2</Notification>
	             <AccessListChange>1</AccessListChange>
	             <cwmp:AccessList>
	               <string>Subscriber</string>
	             </cwmp:AccessList>
	         </cwmp:SetParameterAttributesStruct>
	     </ParameterList>
        </cwmp:SetParameterAttributes>
      </soapenv:Body>
</soapenv:Envelope>
